       IDENTIFICATION DIVISION.
       PROGRAM-ID. BETLANG-FIXTURE.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-COUNTER PIC 9(04) VALUE 0.
       01  WS-NAME    PIC X(20) VALUE 'WORLD'.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM VARYING WS-COUNTER FROM 1 BY 1 UNTIL WS-COUNTER > 3
               DISPLAY 'HELLO ' WS-NAME
           END-PERFORM.
           STOP RUN.
